app/views/topics/show.html.erb

     <p class="lead"><%= @topic.description %></p>
     <% @topic.sponsored_posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" = ?  [["topic_id", 1]]
SELECT "sponsored_posts".* FROM "sponsored_posts" WHERE "sponsored_posts"."topic_id" = ?  [["topic_id", 40]]