app/controllers/advertisements_controller.rb

SELECT "advertisements".* FROM "advertisements"
---
  def index
    @advertisements = Advertisement.all

SELECT  "advertisements".* FROM "advertisements" WHERE "advertisements"."id" = ? LIMIT 1  [["id", nil]]
---
  def show
    @advertisement = Advertisement.find(params[:id])

INSERT INTO "advertisements" ("title", "copy", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @advertisement = Advertisement.new
    @advertisement.title = params[:advertisement][:title]
    @advertisement.copy  = params[:advertisement][:copy]
    @advertisement.price = params[:advertisement][:price]
    if @advertisement.save