app/controllers/sponsored_posts_controller.rb

SELECT  "sponsored_posts".* FROM "sponsored_posts" WHERE "sponsored_posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @sponsored_post = SponsoredPost.find(params[:id])

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "sponsored_posts" ("title", "body", "topic_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "cc"], ["body", "dd"], ["topic_id", 40], ["created_at", "2015-11-22 22:50:31.538277"], ["updated_at", "2015-11-22 22:50:31.538277"]]
---
  def create
    @sponsored_post = SponsoredPost.new
    @sponsored_post.title = params[:sponsored_post][:title]
    @sponsored_post.body  = params[:sponsored_post][:body]
    @topic = Topic.find(params[:topic_id])
    @sponsored_post.topic = @topic
    if @sponsored_post.save

SELECT  "sponsored_posts".* FROM "sponsored_posts" WHERE "sponsored_posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @sponsored_post = SponsoredPost.find(params[:id])

SELECT  "sponsored_posts".* FROM "sponsored_posts" WHERE "sponsored_posts"."id" = ? LIMIT 1  [["id", 52]]
UPDATE "sponsored_posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "sponsored_posts"."id" = ?  [["title", "nn"], ["body", "xx"], ["updated_at", "2015-11-22 23:00:40.873813"], ["id", 52]]
---
  def update
    @sponsored_post = SponsoredPost.find(params[:id])
    @sponsored_post.title = params[:sponsored_post][:title]
    @sponsored_post.body = params[:sponsored_post][:body]

    if @sponsored_post.save