app/controllers/topics_controller.rb

    def create

     @topic = Topic.new(topic_params)

     if @topic.save
---
INSERT INTO "topics" ("name", "description", "public", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

   def update
     @topic = Topic.find(params[:id])

     @topic.assign_attributes(topic_params)
     if @topic.save
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "topics" SET "name" = ?, "description" = ?, "public" = ?, "updated_at" = ? WHERE "topics"."id" = ?

  def destroy
     @topic = Topic.find(params[:id])

     if @topic.destroy
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]